---
title: GeometryObject
classe: Autodesk.Revit.DB.GeometryObject
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# GeometryObject

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId GraphicsStyleId { get; }` | `geometryObject.GraphicsStyleId` | ElementId |
| `Int32 Id { get; }` | `geometryObject.Id` | Int32 |
| `Boolean IsElementGeometry { get; }` | `geometryObject.IsElementGeometry` | Boolean |
| `Visibility Visibility { get; set; }` | `geometryObject.Visibility` | Visibility |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```